In [2]:
import pandas as pd
import numpy as np

## Data wrangling - aggregating 

Questions : https://www.w3resource.com/python-exercises/pandas/groupby/index.php

In [3]:
#test data
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])

In [4]:
#1
print(df.shape)
groups = df.groupby('school_code')
for name, group in groups:
    print(f'\ngroup {name}')
    print(group)

(6, 8)

group s001
   school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30

    address
S1  street1
S4  street1

group s002
   school_code class          name date_Of_Birth   age  height  weight  \
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

    address
S2  street2
S5  street2

group s003
   school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3

group s004
   school_code class          name date_Of_Birth   age  height  weight  \
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address
S6  street4

In [5]:
#2
df.groupby('school_code').agg({'age': ['mean', 'min', 'max']})

              age
             mean min max
school_code
s001         12.5  12  13
s002         13.0  12  14
s003         13.0  13  13
s004         12.0  12  12

In [6]:
#3
res = df.groupby(['school_code', 'class'])
for name, group in res:
    print(name)
    print(group)

('s001', 'V')
   school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35

    address
S1  street1
('s001', 'VI')
   school_code class          name date_Of_Birth   age  height  weight  \
S4        s001    VI  Eesha Hinton     25/09/1998   13     167      30

    address
S4  street1
('s002', 'V')
   school_code class          name date_Of_Birth   age  height  weight  \
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

    address
S2  street2
S5  street2
('s003', 'VI')
   school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3
('s004', 'VI')
   school_code class          name date_Of_Birth   age  height  weight  \
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address
S6  street4

In [7]:
#5
#interesting properties
df.groupby('school_code').size()

school_code
s001    2
s002    2
s003    1
s004    1
dtype: int64

In [8]:
#6
groups = df.groupby('school_code')
groups.get_group('s001')

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1

In [9]:
#8
groups = df.groupby(['school_code', 'class'])
groups.size()

school_code  class
s001         V        1
             VI       1
s002         V        2
s003         VI       1
s004         VI       1
dtype: int64

In [10]:
#9

newdf = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3001,3001,3005,3001,3005,3001,3005,3001,3005,3001,3005,3005],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

In [11]:
newdf.head()

   ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001     150.50  2012-10-05         3001         5002
1   70009     270.65  2012-09-10         3001         5005
2   70002      65.26  2012-10-05         3005         5001
3   70004     110.50  2012-08-17         3001         5003
4   70007     948.50  2012-09-10         3005         5002

In [12]:
newdf.groupby(['customer_id', 'salesman_id']).agg({'purch_amt':'sum'}).sort_values(by=['customer_id', 'purch_amt'])

                         purch_amt
customer_id salesman_id
3001        5003            110.50
            5005            270.65
            5002            400.95
            5006           1983.43
            5001           2400.60
3005        5007             75.29
            5002            948.50
            5003           2480.40
            5001           8870.86

In [13]:
#10
for name, group in newdf.groupby('customer_id'):
    print(name)
    print(list(group['ord_date']))

3001
['2012-10-05', '2012-09-10', '2012-08-17', '2012-07-27', '2012-10-10', '2012-06-27']
3005
['2012-10-05', '2012-09-10', '2012-09-10', '2012-10-10', '2012-08-17', '2012-04-25']

In [14]:
#11
#other solution : result = df.set_index('ord_date').groupby(pd.Grouper(freq='M')).agg({'purch_amt':sum})

newdf['ord_date'] = pd.to_datetime(newdf['ord_date'])

In [15]:
print(min(newdf['ord_date']), max(newdf['ord_date']))
newdf['ord_month'] = newdf['ord_date'].dt.month

2012-04-25 00:00:00 2012-10-10 00:00:00

In [16]:
newdf['ord_monthbis'] = newdf['ord_date'].dt.month_name()

In [17]:
newdf

,ord_no,purch_amt,ord_date,customer_id,salesman_id,ord_month,ord_monthbis
0,70001,150.50,2012-10-05,3001,5002,10,October
1,70009,270.65,2012-09-10,3001,5005,9,September
2,70002,65.26,2012-10-05,3005,5001,10,October
3,70004,110.50,2012-08-17,3001,5003,8,August
4,70007,948.50,2012-09-10,3005,5002,9,September
5,70005,2400.60,2012-07-27,3001,5001,7,July
6,70008,5760.00,2012-09-10,3005,5001,9,September
7,70010,1983.43,2012-10-10,3001,5006,10,October
8,70003,2480.40,2012-10-10,3005,5003,10,October
9,70012,250.45,2012-06-27,3001,5002,6,June
10,70011,75.29,2012-08-17,3005,5007,8,August
11,70013,3045.60,2012-04-25,3005,5001,4,April

In [18]:
newdf.groupby('ord_monthbis').agg({'purch_amt':'sum'})

              purch_amt
ord_monthbis
April           3045.60
August           185.79
July            2400.60
June             250.45
October         4679.59
September       6979.15

In [19]:
#14
df = pd.DataFrame( {'id' : [1, 2, 1, 1, 2, 1, 2], 
                    'type' : [10, 15, 11, 20, 21, 12, 14], 
                    'book' : ['Math','English','Physics','Math','English','Physics','English']})

In [20]:
df.groupby(['id', 'type', 'book']).size().unstack(fill_value=0)

book     English  Math  Physics
id type
1  10          0     1        0
   11          0     0        1
   12          0     0        1
   20          0     1        0
2  14          1     0        0
   15          1     0        0
   21          1     0        0

In [21]:
#15
df = pd.DataFrame({
    'id': [1, 1, 2, 3, 3, 4, 4, 4],
    'value': ['a', 'a', 'b', None, 'a', 'a', None, 'b']
})

In [22]:
df

   id value
0   1     a
1   1     a
2   2     b
3   3  None
4   3     a
5   4     a
6   4  None
7   4     b

In [23]:
df.drop_duplicates().groupby('value').size()
#other solution: print (df.groupby('value')['id'].nunique())

value
a    3
b    2
dtype: int64

In [25]:
#16
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])

In [30]:
print(df.groupby('school_code').groups.keys())
#or 
[mytuple[0] for mytuple in df.groupby('school_code')] #mytuple

dict_keys(['s001', 's002', 's003', 's004'])

['s001', 's002', 's003', 's004']

In [89]:
#20
df = pd.DataFrame( {'id' : ['A','A','A','A','A','A','B','B','B','B','B'], 
                    'type' : [1,1,1,1,2,2,1,1,1,2,2], 
                    'book' : ['Math','Math','English','Physics','Math','English','Physics','English','Physics','English','English']})

In [90]:
df.head()

  id  type     book
0  A     1     Math
1  A     1     Math
2  A     1  English
3  A     1  Physics
4  A     2     Math

In [91]:
df.groupby(['id', 'type'])['book'].agg([('result', lambda x: ','.join(set(x)))])

                       result
id type
A  1     English,Physics,Math
   2             English,Math
B  1          English,Physics
   2                  English

In [92]:
#21
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['05-10-2012','09-10-2012','05-10-2012','08-17-2012','10-09-2012','07-27-2012','10-09-2012','10-10-2012','10-10-2012','06-17-2012','07-08-2012','04-25-2012'],
'customer_id':[3001,3001,3005,3001,3005,3001,3005,3001,3005,3001,3005,3005],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

In [96]:
df['ord_date'] = pd.to_datetime(df['ord_date'])

In [97]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ord_no       12 non-null     int64
 1   purch_amt    12 non-null     float64
 2   ord_date     12 non-null     datetime64[ns]
 3   customer_id  12 non-null     int64
 4   salesman_id  12 non-null     int64
dtypes: datetime64[ns](1), float64(1), int64(3)
memory usage: 608.0 bytes

In [98]:
df.head()

   ord_no  purch_amt   ord_date  customer_id  salesman_id
0   70001     150.50 2012-05-10         3001         5002
1   70009     270.65 2012-09-10         3001         5005
2   70002      65.26 2012-05-10         3005         5001
3   70004     110.50 2012-08-17         3001         5003
4   70007     948.50 2012-10-09         3005         5002

In [102]:
df['quarter'] = df['ord_date'].dt.to_period(freq = 'Q')

In [115]:
print(df.groupby('quarter').agg({'purch_amt': 'sum'}))

#or 

df.groupby('quarter')['purch_amt'].agg([('quaterly_purch', sum)])

         purch_amt
quarter
2012Q2     3511.81
2012Q3     2857.04
2012Q4    11172.33

         quaterly_purch
quarter
2012Q2          3511.81
2012Q3          2857.04
2012Q4         11172.33

**#23**

Write a Pandas program to split the following datasets into groups on customer id and calculate the number of customers starting with 'C', the list of all products and the difference of maximum purchase amount and minimum purchase amount

In [118]:
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5, 270.65, 65.26, 110.5, 948.5, 2400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'ord_date': ['05-10-2012','09-10-2012','05-10-2012','08-17-2012','10-09-2012','07-27-2012','10-09-2012','10-10-2012','10-10-2012','06-17-2012','07-08-2012','04-25-2012'],
'customer_id':['C3001','C3001','D3005','D3001','C3005','D3001','C3005','D3001','D3005','C3001','D3005','D3005'],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

In [134]:
df.groupby('customer_id')['customer_id'].agg([('nb_start_with_c', lambda s : sum(s.str.startswith('C')))])

             nb_start_with_c
customer_id
C3001                      3
C3005                      2
D3001                      0
D3005                      0

In [138]:
df.groupby('customer_id')['ord_no'].agg([('list_of_products', lambda s: list(set(s)))])

                         list_of_products
customer_id
C3001               [70001, 70009, 70012]
C3005                      [70008, 70007]
D3001               [70010, 70004, 70005]
D3005        [70002, 70003, 70011, 70013]

In [147]:
df.groupby('customer_id')['purch_amt'].agg([('etendue', lambda x : max(x) - min(x))])

             etendue
customer_id
C3001         120.15
C3005        4811.50
D3001        2290.10
D3005        2980.34